# This entire file will be ignored by Pylint. pylint: skip-file
from random import randint

""" დაწერეთ პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum =0,
შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ესპროცესი გაგრძელდეს
 იქამდე სანამმომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი
"""


total_sum = 0

user_input = ""

while user_input != "sum":
    random_numb = randint(-100, 100)
    user_input = input("type sum: ")
    if random_numb > 0:
        print(random_numb)
        total_sum += random_numb

print(total_sum)


"""გამოთვალეთ რიცხვების ჯამი, სანამ მომხმარებელი არ შეიყვანს 0-ს"""

total = 0

while True:
    user_number = int(input("type number: "))
    if user_number == 0:
        print(f"Total is {total}")
        break
    else:
        total += user_number


# მომხარებელმა უნდა გამოიცნოს რიცხვი თუ მაღალი იქნება რიცხვი უნდა შეატყობინოს თუ დაბალი მაგაზე უნდა შეატყობინოს მომხმარებელს

random_numb = randint(1, 10)

guess_numb = 0

life = 1

# while random_numb != guess_numb:
#     user_input = int(input("შეიყვანეთ რიცხვი: "))
#     guess_numb = user_input
#     if user_input > random_numb:
#         print('რიცხვი მაღალია')
#     elif user_input < random_numb:
#         print('რიცხვი დაბალია')
#     else:
#         print(f"გილოცავთ,გამოცნობილი რიცხვია {guess_numb}")

while life != 4:
    guess_numb = int(input("შეიყვანეთ რიცხვი: "))

    if guess_numb > random_numb:
        print("რიცხვი მაღალია")
        life += 1
    elif guess_numb < random_numb:
        print("რიცხვი დაბალია")
        life += 1
    else:
        print(
            f"გილოცავთ,გამოცნობილი რიცხვია {guess_numb}, მცდელობების რაოდენობა {life}"
        )
        break
else:
    print(f"სამწუხაროდ ვერ გამოიცანი 😔 სწორი პასუხი იყო {random_numb}")
