import random
from random import randint

# იუზერმა უნდა ჩაწეროს 5 რიცხვი, უნდა დავითვალოთ ამ რიცხვების ჯამი და შემდგომ გამოვითვალოთ საშუალო

# total=0
#
# for i in range(5):
#     user_input = int(input("შეიყვანეთ რიცხვი : "))
#     total += user_input
#
# print(total)

# მომხარებელმა უნდა გამოიცნოს რიცხვი თუ მაღალი იქნება რიცხვი უნდა შეატყობინოს თუ დაბალი მაგაზე უნდა შეატყობინოს მომხმარებელს

random_numb = randint(1, 10)

guess_numb = 0

life = 1

# while random_numb != guess_numb:
#     user_input = int(input("შეიყვანეთ რიცხვი: "))
#     guess_numb = user_input
#     if user_input > random_numb:
#         print('რიცხვი მაღალია')
#     elif user_input < random_numb:
#         print('რიცხვი დაბალია')
#     else:
#         print(f"გილოცავთ,გამოცნობილი რიცხვია {guess_numb}")

while life != 4:
    guess_numb = int(input("შეიყვანეთ რიცხვი: "))

    if guess_numb > random_numb:
        print("რიცხვი მაღალია")
        life += 1
    elif guess_numb < random_numb:
        print("რიცხვი დაბალია")
        life += 1
    else:
        print(
            f"გილოცავთ,გამოცნობილი რიცხვია {guess_numb}, მცდელობების რაოდენობა {life}"
        )
        break
else:
    print(f"სამწუხაროდ ვერ გამოიცანი 😔 სწორი პასუხი იყო {random_numb}")
