# დაწერეთ პროგრამა რომელიც კითხულობს სამ მთელ რიცხვს და ეკრანზე(ტერმინალში) გამოაქვს მათი ჯამი.

num_1 = 1
num_2 = 2
num_3 = 3

total = num_1 + num_2 + num_3

print(f"დავალება 1 : {total}")


print("------------------------")


"""
დაწერეთ პროგრამა, რომელიც გარდაქმნის ტემპერატურას ცელსიუსიდან ფარენჰეიტში. 
გამოიყენეთ ცვლადი ცელსიუსის ტემპერატურის შესანახად, შეასრულეთ კონვერტაცია 
ფორმულის გამოყენებით (ცელსიუსი * 9/5) + 32 და დაბეჭდეთ შედეგი.
"""

user_input = int(input("შეიყვანეთ რიცხვი ცელსიუსში ფარენჰეიტში გადასაყვანად: "))

cel_faren = (user_input * 9/5) +32

print(f"{user_input} გრადუსი ფარენჰეიტში იქნება {cel_faren}")


print("------------------------")


"""
დაწერეთ პითონის პროგრამა, რომელიც იღებს მომხმარებლისგან კუბის გვერდის სიგრძეს
და ითვლის კუბის ზედაპირის ფართობსაც და მოცულობასაც და შემდეგ ამობეჭდავს ფართობსაც და მოცულობასაც.
"""

kutxe = int(input("შეიყვანეთ კუბის გვერდის სიგრძე: "))

zedapiri = 6 * kutxe * kutxe
total = kutxe * kutxe * kutxe

print(f"ზედაპირის ფართობი: {zedapiri}")
print(f"მოცულობა: {total}")

